hong12234/STM32F103/0.96 OLED - Watch/User/oled/OLED_I2C.h
#ifndef __OLED_I2C_H
#define	__OLED_I2C_H

#include "stm32f10x.h"

#define OLED_ADDRESS	0x78 //通过调整0R电阻,屏可以0x78和0x7A两个地址 -- 默认0x78

void I2C_WriteByte(unsigned char addr,unsigned char data);
void WriteCmd(unsigned char I2C_Command);
void WriteDat(unsigned char I2C_Data);
void OLED_Init(void);
void OLED_Set_Pos(unsigned char x, unsigned char y);
void OLED_Fill(unsigned char fill_Data);
void OLED_CLS(void);
void OLED_ON(void);
void OLED_OFF(void);
void OLED_F10x32(unsigned char x, unsigned char y, unsigned char num);
void OLED_F10x48(unsigned char x, unsigned char y);
void OLED_F20x48(unsigned char x, unsigned char y, unsigned char num);
void OLED_ShowStr(unsigned char x, unsigned char y,unsigned char ch[], unsigned char TextSize);
void OLED_ShowCN(unsigned char x, unsigned char y, unsigned char N,unsigned char z);
void OLED_DrawBMP(unsigned char x0,unsigned char y0,unsigned char x1,unsigned char y1,unsigned char BMP[]);

#endif
